create_supply_set SS_A
create_power_domain PD_A -elements {top}
set_domain_supply_net PD_A VDD_A
set_isolation iso_a -domain PD_A -applies_to outputs -clamp_value 0 -isolation_signal iso_en
set_level_shifter ls_a -from PD_A -to PD_B -applies_to outputs
set_retention ret_a -domain PD_A -retention_register state -save_signal save -restore_signal restore
